mostick/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
front
     { 
           type wedge;
      }
back
     { 
           type wedge;
      }
     tankWall
     { 
           type            noSlip;
      }
     bottom
     { 
           type            noSlip;
      }
     top
     { 
           type            noSlip;
      }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
