mostick/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.3;

deltaT          2.5e-3;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.0;

maxAlphaCo      0.9;

maxDeltaT       1;

functions
{

    probes1
    {
     type probes;

     functionObjectLibs ("libsampling.so");

     region region0;

     probeLocations
     (
          (0.001 0 0.005)
          (0.002 0 0.005)
         (0.003 0 0.005)
         (0.003 0 0.008)
     );

     fields
     (
        
        alpha.water
        U
        
     );

      writeControl   adjustableRunTime;
      writeInterval  2.5e-2;
       
     }

}
// ************************************************************************* //
