mostick/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.water
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;
        cAlpha          1;
    }

    "pcorr.*"
    {
        solver           PCG;
        preconditioner 
        {
                preconditioner GAMG;
        	tolerance       1e-05;
        	relTol          0;
        	smoother         GaussSeidel;
        	cacheAgglomeration true;
       		nCellsInCoarsestLevel 50;
        	agglomerator    faceAreaPair;
        	mergeLevels     1;
        }

        minIter           0;
        maxIter           100;
        tolerance         1e-5;
        relTol            0.0;
    }

    p_rgh
    {
        solver           PCG;
        preconditioner 
        {
                preconditioner GAMG;
        	tolerance       1e-05;
        	relTol          0;
        	smoother         GaussSeidel;
        	cacheAgglomeration true;
       		nCellsInCoarsestLevel 50;
        	agglomerator    faceAreaPair;
        	mergeLevels     1;
        }

        minIter           0;
        maxIter           100;
        tolerance         1e-5;
        relTol            0.0;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       3e-07;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     8;
    nNonOrthogonalCorrectors 0;
    pRefCell 101;
    pRefValue 0; 
}

relaxationFactors
{
    fields
    {
        p_rgh               0.75;
    }
    equations
    {
        U               0.95;
    }
}


// ************************************************************************* //
